# Normal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..Normal Property
RebarContainerItem Class See Also
---
A unit-length vector normal to the plane of the rebar
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Normal { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Normal As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Normal {
	XYZ^ get ();
}
```

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace